@sandkum5 Can you please provide more details regarding this issue.
#### 1. What was the configuration tried to execute?
#### 2. What was the output/error you received in order to say the above mentioned fields are missing in the definition?


### Conclusion:
Wasn't able to reproduce the issue mentioned above. 
Was able to create the policy successfully with following configuration.

#### Version used: v1.0.22 (latest)

#### Configuration used 
```hcl
resource "intersight_access_policy" "access1" {
  name        = "access1"
  description = "demo imc access policy"
  inband_vlan = 19
  organization {
    object_type = "organization.Organization"
    moid        = data.intersight_organization_organization.default.results.0.moid
  }
  configuration_type{
	configure_inband = false
	configure_out_of_band = true
  }
  out_of_band_ip_pool {
	object_type = "ippool.Pool"
	moid = var.ip_pool_moid
  }
}
```

#### Output on "terraform apply"
```bash
D:\Cisco_Intersight\Terraform>terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # intersight_access_policy.access1 will be created
  + resource "intersight_access_policy" "access1" {
      + account_moid         = (known after apply)
      + address_type         = (known after apply)
      + ancestors            = (known after apply)
      + class_id             = "access.Policy"
      + configuration_type   = [
          + {
              + additional_properties = null
              + class_id              = "access.ConfigurationType"
              + configure_inband      = false
              + configure_out_of_band = true
              + object_type           = "access.ConfigurationType"
            },
        ]
      + create_time          = (known after apply)
      + description          = "demo imc access policy"
      + domain_group_moid    = (known after apply)
      + id                   = (known after apply)
      + inband_ip_pool       = (known after apply)
      + inband_vlan          = 19
      + inband_vrf           = (known after apply)
      + mod_time             = (known after apply)
      + moid                 = (known after apply)
      + name                 = "access1"
      + object_type          = "access.Policy"
      + organization         = [
          + {
              + additional_properties = null
              + class_id              = "mo.MoRef"
              + moid                  = "60000000000000REPLACED"
              + object_type           = "organization.Organization"
              + selector              = null
            },
        ]
      + out_of_band_ip_pool  = [
          + {
              + additional_properties = null
              + class_id              = "mo.MoRef"
              + moid                  = "6000000000000REPLACED"
              + object_type           = "ippool.Pool"
              + selector              = null
            },
        ]
      + out_of_band_vrf      = (known after apply)
      + owners               = (known after apply)
      + parent               = (known after apply)
      + permission_resources = (known after apply)
      + profiles             = (known after apply)
      + shared_scope         = (known after apply)
      + tags                 = (known after apply)
      + version_context      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
intersight_access_policy.access1: Creating...
intersight_access_policy.access1: Creation complete after 1s [id=61fa19636275722d31359f68]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

